openfoam/tutorials/multiphase/overInterDyMFoam/twoSquaresOutDomain/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (overset fvMotionSolvers);

application     overInterDyMFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         0.08;

deltaT          0.001;

writeControl    adjustable;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1.5;

maxAlphaCo      2.0;

maxDeltaT       1;


functions
{
    probes
    {
        type            probes;
        libs            (sampling);
        name            probes;
        writeControl    timeStep;
        writeInterval   1;
        fields          (p U);
        interpolationScheme cell;
        probeLocations
        (
             (0.0009999 0.0015 0.003)
        );
    }

    alphaVol
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        fields          (alpha.water);
        operation       volIntegrate;
        regionType      all;
        postOperation   none;
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             true;
    }
}


// ************************************************************************* //
